---
kind: other
id: Methods.T:Autodesk.Revit.DB.Definition
source: html/898c7d74-e132-2cf7-f3e8-f06be0e70eff.htm
---
# Definition Methods

Gets a ForgeTypeId identifying the data type describing values of the parameter.